Workshop.org
#+TITLE: Having your Raspberry Pi and Sharing it Too
#+AUTHOR: Jim Klassen, Bob Basques
#+DATE: <2019-04-18 Thu>

* Introduction
** Background
   The Raspberry Pi is a credit card sized computer produced by the
   Raspberry Pi Foundation.  We will focus on the current top of the
   line model, the 3B+, which has a 1.2 GHz 4-core ARM v8 processor,
   1GB of RAM, and built in WiFi, Bluetooth, HDMI, and Ethernet.

   This isn't powerful by modern PC standards, but it is still plenty
   capable of being a miniature server.

   The primary operating system is Raspbian which is a Debian Linux
   derivative, although other Linux distributions such as Arch,
   Fedora, and Ubuntu are available.  Other operating systems such as
   FreeBSD, RISC OS, etc. are also available.  We will stick with
   Raspbian for this workshop because it is the most common and best
   supported.

   The important point though is after some hardware specific setup
   steps, the Raspberry Pi is essentially a standard GNU/Linux system
   and much of what you may know about working with GNU/Linux systems
   will equally apply to the Pi.  The main differences compared to a
   standard x86 desktop or server are the limited RAM, and slower
   storage.  Also keep in mind that this is an ARM processor so x86
   binaries will not run (although this tends not to be a problem in
   the FOSS ecosystem were you can freely recompile programs for your
   computer.)  In any case, you will likely find most of what you need
   is already included in Raspbian.

** Goal
   The goal of this workshop is to learn how to setup a Raspberry Pi
   to be a miniature server you can take with you into the field.  At
   the end of the workshop you will have a Raspberry Pi that acts as a
   stand alone 802.11 access point that users can connect to with
   their normal client devices (phones, tablets, laptops, etc.).

   To have a concrete example, we will install the GeoMoose 3 demo
   (which includes Apache, MapServer, and optionally PostGIS).  The
   intent though is to show you how you might approach building such a
   system, with whatever FOSS stack you need for purposes, rather than
   focus on GeoMoose.

* Install Raspbian Full 2019-04 to a SD Card 
** Download a Raspbian image
   Raspbian is the default operating system on the Raspberry Pi.  It
   is essentially a port of Debian to the Raspberry Pi devices with some
   tweaks to optimize it for the Raspberry Pi hardware and to make it a
   easier to use out of the box.

   Raspbian can be downloaded at: [https://www.raspberrypi.org/downloads/raspbian/]

   The Raspberry Pi foundation currently provides 3 choices of Raspbian images: 
   - Full (includes desktop and recommended software)
   - Desktop (includes the desktop)
   - Lite (a command line only minimal image)  

   The primary difference between the images is what software is
   installed by default in the image.

   For the purposes of this workshop, we are going with the Full image
   because it provides the best experience for getting started with
   the Raspberry Pi.

   For an actual server deployment, the Lite image would be more
   appropriate to avoid installing a bunch of software you don't need,
   and then install only what you need.

** Copy Image to SD Card
   Once you have the Raspbian image downloaded, you will find a =.img=
   file inside a =.zip= file.  This =.img= file needs to be copied
   onto a SD card to boot the Pi.

   Note this is a disk image, not a "file" so you need a special tool
   to copy it to the SD card.  The Raspberry Pi Foundation provides
   recommendations for doing this [[https://www.raspberrypi.org/documentation/installation/installing-images/README.md][here]].

   If you are on a Linux (or Linux like) operating system you can also
   use the =dd= command to copy the =.img= to the corresponding raw
   device (being careful to not overwrite the wrong device on your
   computer). (e.g.: =sudo dd if=2019-04-08-raspbian-stretch-full.img
   of=/dev/mmcblk0 bs=1M oflag=direct=)

   This image contains two partitions: A FAT32 partition with the boot
   files, and an ext4 partition with the Linux filesystem.  Note: if
   you are looking at the card on a non-Linux machine, you likely
   won't be able to see the files on the ext4 partition.
   
** First Boot
   On the first boot of freshly installed Raspbian on the Raspberry
   Pi it will ask a number of questions such as what keyboard layout,
   country (sets internationalization and WiFi channels), setup a
   network connection, change the default password, and to install
   updates.

   To do answer these questions, it is easiest to plug the Pi into a
   HDMI monitor and USB keyboard and mouse.

** Enable SSH
   Now is a good time to enable SSH access to your Pi.  This will allow you
   to get a remote secure shell as well as make it easier to transfer files
   with scp/sftp.

   This can be done from the desktop by going to the Pi menu then:
   1. Open Preferences->Raspberry Pi Configuration
   1. Click the Interfaces Tab
   1. Enable SSH 
   1. Click OK
   
   Alternatively, from a command prompt:
   #+BEGIN_SRC sh
     sudo raspi-config
   #+END_SRC

   Then select =5 Interfacing Options=, then =P2 SSH=, then =YES=.

** Next steps
   At this point the Pi is basically setup and you can explore it.
   The next step will be to install the software needed and configure
   it as a miniature server.

* Creating a Stand alone WiFi access point
