Workshop.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-18 Thu 01:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Having your Raspberry Pi and Sharing it Too</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jim Klassen, Bob Basques" />
</head>
<body>
<div id="content">
<h1 class="title">Having your Raspberry Pi and Sharing it Too</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfcc04b0">1. Introduction</a>
<ul>
<li><a href="#org71fcd53">1.1. Background</a></li>
<li><a href="#org1bbc9a5">1.2. Goal</a></li>
</ul>
</li>
<li><a href="#org20630fe">2. Install Raspbian Full 2019-04 to a SD Card</a>
<ul>
<li><a href="#org652a49b">2.1. Download a Raspbian image</a></li>
<li><a href="#org734ea67">2.2. Copy Image to SD Card</a></li>
<li><a href="#org8e5a3c9">2.3. First Boot</a></li>
<li><a href="#org8df0725">2.4. Enable SSH</a></li>
<li><a href="#org430f239">2.5. Next steps</a></li>
</ul>
</li>
<li><a href="#orgba18c25">3. Creating a Stand alone WiFi access point</a>
<ul>
<li><a href="#org56e838a">3.1. Open a terminal</a></li>
<li><a href="#orgf7d4220">3.2. Install HostAPd</a></li>
<li><a href="#org5617017">3.3. Install  DNSMASQ (DHCP server)</a></li>
<li><a href="#org0f3ab60">3.4. Configure the network interfaces</a></li>
<li><a href="#org14d4181">3.5. Give your Pi a hostname</a></li>
<li><a href="#org555989e">3.6. Restart your Pi</a></li>
<li><a href="#org51d9508">3.7. Now you should be able to connect to your Pi via WiFi</a></li>
</ul>
</li>
<li><a href="#org2957fc2">4. Installing GeoMoose</a>
<ul>
<li><a href="#org71ea4de">4.1. Again get a root shell</a></li>
<li><a href="#org90e788b">4.2. Install Apache</a></li>
<li><a href="#org992aa4c">4.3. Install Mapserver (and friends)</a></li>
<li><a href="#org590a350">4.4. Install PostGIS (if you want to)</a></li>
<li><a href="#org3d57fdf">4.5. Install GeoMoose</a>
<ul>
<li><a href="#org2260759">4.5.1. Download and unzip GeoMoose</a></li>
<li><a href="#org2d61e0e">4.5.2. Configure GeoMoose for the install paths</a></li>
<li><a href="#org6eae24e">4.5.3. Test GeoMoose</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5675bad">5. Final Touches</a>
<ul>
<li><a href="#org5dced74">5.1. Shutdown CGI Script</a></li>
<li><a href="#org3a3a22a">5.2. Install a Firewall</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgfcc04b0" class="outline-2">
<h2 id="orgfcc04b0"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org71fcd53" class="outline-3">
<h3 id="org71fcd53"><span class="section-number-3">1.1</span> Background</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The Raspberry Pi is a credit card sized computer produced by the
Raspberry Pi Foundation.  We will focus on the current top of the
line model, the 3B+, which has a 1.2 GHz 4-core ARM v8 processor,
1GB of RAM, and built in WiFi, Bluetooth, HDMI, and Ethernet.
</p>

<p>
This isn't powerful by modern PC standards, but it is still plenty
capable of being a miniature server.
</p>

<p>
The primary operating system is Raspbian which is a Debian Linux
derivative, although other Linux distributions such as Arch,
Fedora, and Ubuntu are available.  Other operating systems such as
FreeBSD, RISC OS, etc. are also available.  We will stick with
Raspbian for this workshop because it is the most common and best
supported.
</p>

<p>
The important point though is after some hardware specific setup
steps, the Raspberry Pi is essentially a standard GNU/Linux system
and much of what you may know about working with GNU/Linux systems
will equally apply to the Pi.  The main differences compared to a
standard x86 desktop or server are the limited RAM, and slower
storage.  Also keep in mind that this is an ARM processor so x86
binaries will not run (although this tends not to be a problem in
the FOSS ecosystem were you can freely recompile programs for your
computer.)  In any case, you will likely find most of what you need
is already included in Raspbian.
</p>
</div>
</div>

<div id="outline-container-org1bbc9a5" class="outline-3">
<h3 id="org1bbc9a5"><span class="section-number-3">1.2</span> Goal</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The goal of this workshop is to learn how to setup a Raspberry Pi
to be a miniature server you can take with you into the field.  At
the end of the workshop you will have a Raspberry Pi that acts as a
stand alone 802.11 access point that users can connect to with
their normal client devices (phones, tablets, laptops, etc.).
</p>

<p>
To have a concrete example, we will install the GeoMoose 3 demo
(which includes Apache, MapServer, and optionally PostGIS).  The
intent though is to show you how you might approach building such a
system, with whatever FOSS stack you need for purposes, rather than
focus on GeoMoose.
</p>
</div>
</div>
</div>

<div id="outline-container-org20630fe" class="outline-2">
<h2 id="org20630fe"><span class="section-number-2">2</span> Install Raspbian Full 2019-04 to a SD Card</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org652a49b" class="outline-3">
<h3 id="org652a49b"><span class="section-number-3">2.1</span> Download a Raspbian image</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Raspbian is the default operating system on the Raspberry Pi.  It
is essentially a port of Debian to the Raspberry Pi devices with some
tweaks to optimize it for the Raspberry Pi hardware and to make it a
easier to use out of the box.
</p>

<p>
Raspbian can be downloaded at: [<a href="https://www.raspberrypi.org/downloads/raspbian/">https://www.raspberrypi.org/downloads/raspbian/</a>]
</p>

<p>
The Raspberry Pi foundation currently provides 3 choices of Raspbian images: 
</p>
<ul class="org-ul">
<li>Full (includes desktop and recommended software)</li>
<li>Desktop (includes the desktop)</li>
<li>Lite (a command line only minimal image)</li>
</ul>

<p>
The primary difference between the images is what software is
installed by default in the image.
</p>

<p>
For the purposes of this workshop, we are going with the Full image
because it provides the best experience for getting started with
the Raspberry Pi.
</p>

<p>
For an actual server deployment, the Lite image would be more
appropriate to avoid installing a bunch of software you don't need,
and then install only what you need.
</p>
</div>
</div>

<div id="outline-container-org734ea67" class="outline-3">
<h3 id="org734ea67"><span class="section-number-3">2.2</span> Copy Image to SD Card</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Once you have the Raspbian image downloaded, you will find a <code>.img</code>
file inside a <code>.zip</code> file.  This <code>.img</code> file needs to be copied
onto a SD card to boot the Pi.
</p>

<p>
Note this is a disk image, not a "file" so you need a special tool
to copy it to the SD card.  The Raspberry Pi Foundation provides
recommendations for doing this <a href="https://www.raspberrypi.org/documentation/installation/installing-images/README.md">here</a>.
</p>

<p>
If you are on a Linux (or Linux like) operating system you can also
use the <code>dd</code> command to copy the <code>.img</code> to the corresponding raw
device (being careful to not overwrite the wrong device on your
computer). (e.g.: <code>sudo dd if=2019-04-08-raspbian-stretch-full.img
   of=/dev/mmcblk0 bs=1M oflag=direct</code>)
</p>

<p>
This image contains two partitions: A FAT32 partition with the boot
files, and an ext4 partition with the Linux filesystem.  Note: if
you are looking at the card on a non-Linux machine, you likely
won't be able to see the files on the ext4 partition.
</p>
</div>
</div>

<div id="outline-container-org8e5a3c9" class="outline-3">
<h3 id="org8e5a3c9"><span class="section-number-3">2.3</span> First Boot</h3>
<div class="outline-text-3" id="text-2-3">
<p>
On the first boot of freshly installed Raspbian on the Raspberry
Pi it will ask a number of questions such as what keyboard layout,
country (sets internationalization and WiFi channels), setup a
network connection, change the default password, and to install
updates.
</p>

<p>
To do answer these questions, it is easiest to plug the Pi into a
HDMI monitor and USB keyboard and mouse.
</p>
</div>
</div>

<div id="outline-container-org8df0725" class="outline-3">
<h3 id="org8df0725"><span class="section-number-3">2.4</span> Enable SSH</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Now is a good time to enable SSH access to your Pi.  This will allow you
to get a remote secure shell as well as make it easier to transfer files
with scp/sftp.
</p>

<p>
This can be done from the desktop by going to the Pi menu then:
</p>
<ol class="org-ol">
<li>Open Preferences-&gt;Raspberry Pi Configuration</li>
<li>Click the Interfaces Tab</li>
<li>Enable SSH</li>
<li>Click OK</li>
</ol>

<p>
Alternatively, from a command prompt:
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo raspi-config
</pre>
</div>

<p>
Then select <code>5 Interfacing Options</code>, then <code>P2 SSH</code>, then <code>YES</code>.
</p>
</div>
</div>

<div id="outline-container-org430f239" class="outline-3">
<h3 id="org430f239"><span class="section-number-3">2.5</span> Next steps</h3>
<div class="outline-text-3" id="text-2-5">
<p>
At this point the Pi is basically setup and you can explore it.
The next step will be to install the software needed and configure
it as a miniature server.
</p>
</div>
</div>
</div>

<div id="outline-container-orgba18c25" class="outline-2">
<h2 id="orgba18c25"><span class="section-number-2">3</span> Creating a Stand alone WiFi access point</h2>
<div class="outline-text-2" id="text-3">
</div>
