Workshop.org
** Open a terminal
   We need to type commands into the Pi to install and configure the
   WiFi access point and associated software.  Since we are making
   system level change, we need to be root (the administrative user).
   To do this enter:

   #+BEGIN_SRC sh
   sudo su
   #+END_SRC
   
   At the prompt.

   The prompt should change from ending with a =$= to ending with =#=
   to indicate you are root.


** Install HostAPd

   (Roughly following the instructions at:
   https://frillip.com/using-your-raspberry-pi-3-as-a-wifi-access-point-with-hostapd/)

   #+BEGIN_SRC sh
     apt install hostapd
     zcat /usr/share/doc/hostapd/examples/hostapd.conf.gz > /etc/hostapd/hostapd.conf
   #+END_SRC

   Edit /etc/hostapd/hostapd.conf and set:
   - =ssid=<whatever you want>=
   - =driver=nl80211=
   - =ieee80211n=1=
   - =wpa=2=
   - =wpa_passphrase=<whatever you want>=
   - =wpa_key_mgmt=WPA-PSK=
   - =wpa_pairwise=TKIP CCMP=
   - =rsn_pairwise=CCMP=

   Test hostapd configuration:
   #+BEGIN_SRC sh
   hostapd -d /etc/hostapd/hostapd.conf
   #+END_SRC

   If it worked, you should see a bunch of log messages scrolling by
   as it sets up the access point.  Type =Control-C= to exit.
   
   #+BEGIN_SRC
   random: Trying to read entropy from /dev/random
   Configuration file: /etc/hostapd/hostapd.conf
   ctrl_interface_group=0
   nl80211: TDLS supported
   nl80211: Supported cipher 00-0f-ac:1
   nl80211: Supported cipher 00-0f-ac:5
   nl80211: Supported cipher 00-0f-ac:2
   nl80211: Supported cipher 00-0f-ac:4
   nl80211: Supported cipher 00-0f-ac:6
   ...
   wlan0: Event CHANNEL_LIST_CHANGED (29) received
   nl80211: Drv Event 33 (NL80211_CMD_TRIGGER_SCAN) received for wlan0
   wlan0: nl80211: Scan trigger
   wlan0: Event SCAN_STARTED (48) received
   Unknown event 48
   VLAN: RTM_NEWLINK: ifi_index=3 ifname=wlan0 ifi_family=0 ifi_flags=0x11043 ([UP][RUNNING][LOWER_UP])
   VLAN: vlan_newlink(wlan0)
   RTM_NEWLINK: ifi_index=3 ifname=wlan0 operstate=6 linkmode=0 ifi_family=0 ifi_flags=0x11043 ([UP][RUNNING][LOWER_UP])
   #+END_SRC

   If it didn't work it there will be error/failed messages and it
   will return you to the prompt.

   #+BEGIN_SRC
   Configuration file: /etc/hostapd/hostapd.conf
   Line 3: invalid line 'foo'
   ctrl_interface_group=0
   1 errors found in configuration file '/etc/hostapd/hostapd.conf'
   Failed to set up interface with /etc/hostapd/hostapd.conf
   hostapd_init: free iface 0x1144cf8
   Failed to initialize interface
   root@raspberrypi:/home/pi# 
   #+END_SRC

** Install  DNSMASQ (DHCP server)
   #+BEGIN_SRC sh
     apt install dnsmasq
   #+END_SRC

   Create /etc/dnsmasq.d/wlan0.conf:
   #+BEGIN_SRC
   interface=wlan0

   #no-resolv
   local=/pinet/
   address=/pinet/192.168.99.1
   dhcp-range=192.168.99.2,192.168.99.254,1h
   dhcp-authoritative
   #+END_SRC

** Configure the network interfaces
   Edit /etc/network/interfaces:
   #+BEGIN_SRC sh
   allow-hotplug eth0
   iface eth0 inet dhcp

   allow-hotplug wlan0
   iface wlan0 inet static
     hostapd /etc/hostapd/hostapd.conf
     address 192.168.99.1
     netmask 255.255.255.0
     network 192.168.99.0
     broadcast 192.168.99.255
   #+END_SRC

   And start the interfaces:

   #+BEGIN_SRC sh
   ifup eth0
   ifup wlan0
   #+END_SRC

** Give your Pi a hostname
   Edit =/etc/hosts=

   #+BEGIN_SRC
   192.168.99.1	raspberrypi raspberrypi.pinet
   #+END_SRC

** Restart your Pi
   
   #+BEGIN_SRC sh
   reboot
   #+END_SRC

** Now you should be able to connect to your Pi via WiFi

* Installing GeoMoose
** Again get a root shell
   Open a terminal (or connect via =ssh pi@192.168.99.1= or =ssh
   pi@raspberrypi.pinet=)

   #+BEGIN_SRC sh
   sudo su
   #+END_SRC

** Install Apache

   #+BEGIN_SRC sh
   apt install apache2
   a2enmod cgi
   systemctl stop apache2
   systemctl start apache2
   #+END_SRC

** Install Mapserver (and friends)
   #+BEGIN_SRC sh
   apt install cgi-mapserver mapserver-bin gdal-bin proj-bin
   #+END_SRC

** Install PostGIS (if you want to)
   #+BEGIN_SRC sh
   apt install postgis
   #+END_SRC

** Install GeoMoose
*** Download and unzip GeoMoose
    #+BEGIN_SRC sh
    mkdir -p /srv/geomoose
    cd /srv/geomoose
    wget https://www.geomoose.org/downloads/gm3-examples-3.3.0.zip
    wget https://www.geomoose.org/downloads/gm3-demo-data-3.3.0.zip

    unzip gm3-examples-3.3.0.zip
    unzip gm3-demo-data-3.3.0.zip
    #+END_SRC

*** Configure GeoMoose for the install paths
    Setup =/srv/geomoose/gm3-examples/htdocs/desktop/config.js=:    
    #+BEGIN_SRC js
    CONFIG = {
        mapserver_url: '/cgi-bin/mapserv',
        mapfile_root: '/srv/geomoose/gm3-demo-data/'
    };
    #+END_SRC

    Add GeoMoose to the web-root:
    #+BEGIN_SRC sh
    ln -s /srv/geomoose/gm3-examples/htdocs /var/www/html/geomoose
    #+END_SRC

*** Test GeoMoose
    http://192.168.99.1/geomoose/desktop/

    or
    
    http://raspberrypi.pinet/geomoose/desktop/

* Final Touches
