Workshop.html
<div id="outline-container-org56e838a" class="outline-3">
<h3 id="org56e838a"><span class="section-number-3">3.1</span> Open a terminal</h3>
<div class="outline-text-3" id="text-3-1">
<p>
We need to type commands into the Pi to install and configure the
WiFi access point and associated software.  Since we are making
system level change, we need to be root (the administrative user).
To do this enter:
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo su
</pre>
</div>

<p>
At the prompt.
</p>

<p>
The prompt should change from ending with a <code>$</code> to ending with <code>#</code>
to indicate you are root.
</p>
</div>
</div>


<div id="outline-container-orgf7d4220" class="outline-3">
<h3 id="orgf7d4220"><span class="section-number-3">3.2</span> Install HostAPd</h3>
<div class="outline-text-3" id="text-3-2">
<p>
(Roughly following the instructions at:
<a href="https://frillip.com/using-your-raspberry-pi-3-as-a-wifi-access-point-with-hostapd/">https://frillip.com/using-your-raspberry-pi-3-as-a-wifi-access-point-with-hostapd/</a>)
</p>

<div class="org-src-container">
<pre class="src src-sh">apt install hostapd
zcat /usr/share/doc/hostapd/examples/hostapd.conf.gz &gt; /etc/hostapd/hostapd.conf
</pre>
</div>

<p>
Edit /etc/hostapd/hostapd.conf and set:
</p>
<ul class="org-ul">
<li><code>ssid=&lt;whatever you want&gt;</code></li>
<li><code>driver=nl80211</code></li>
<li><code>ieee80211n=1</code></li>
<li><code>wpa=2</code></li>
<li><code>wpa_passphrase=&lt;whatever you want&gt;</code></li>
<li><code>wpa_key_mgmt=WPA-PSK</code></li>
<li><code>wpa_pairwise=TKIP CCMP</code></li>
<li><code>rsn_pairwise=CCMP</code></li>
</ul>

<p>
Test hostapd configuration:
</p>
<div class="org-src-container">
<pre class="src src-sh">hostapd -d /etc/hostapd/hostapd.conf
</pre>
</div>

<p>
If it worked, you should see a bunch of log messages scrolling by
as it sets up the access point.  Type <code>Control-C</code> to exit.
</p>

<pre class="example">
random: Trying to read entropy from /dev/random
Configuration file: /etc/hostapd/hostapd.conf
ctrl_interface_group=0
nl80211: TDLS supported
nl80211: Supported cipher 00-0f-ac:1
nl80211: Supported cipher 00-0f-ac:5
nl80211: Supported cipher 00-0f-ac:2
nl80211: Supported cipher 00-0f-ac:4
nl80211: Supported cipher 00-0f-ac:6
...
wlan0: Event CHANNEL_LIST_CHANGED (29) received
nl80211: Drv Event 33 (NL80211_CMD_TRIGGER_SCAN) received for wlan0
wlan0: nl80211: Scan trigger
wlan0: Event SCAN_STARTED (48) received
Unknown event 48
VLAN: RTM_NEWLINK: ifi_index=3 ifname=wlan0 ifi_family=0 ifi_flags=0x11043 ([UP][RUNNING][LOWER_UP])
VLAN: vlan_newlink(wlan0)
RTM_NEWLINK: ifi_index=3 ifname=wlan0 operstate=6 linkmode=0 ifi_family=0 ifi_flags=0x11043 ([UP][RUNNING][LOWER_UP])
</pre>

<p>
If it didn't work it there will be error/failed messages and it
will return you to the prompt.
</p>

<pre class="example">
Configuration file: /etc/hostapd/hostapd.conf
Line 3: invalid line 'foo'
ctrl_interface_group=0
1 errors found in configuration file '/etc/hostapd/hostapd.conf'
Failed to set up interface with /etc/hostapd/hostapd.conf
hostapd_init: free iface 0x1144cf8
Failed to initialize interface
root@raspberrypi:/home/pi# 
</pre>
</div>
</div>

<div id="outline-container-org5617017" class="outline-3">
<h3 id="org5617017"><span class="section-number-3">3.3</span> Install  DNSMASQ (DHCP server)</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-sh">apt install dnsmasq
</pre>
</div>

<p>
Create /etc/dnsmasq.d/wlan0.conf:
</p>
<pre class="example">
interface=wlan0

#no-resolv
local=/pinet/
address=/pinet/192.168.99.1
dhcp-range=192.168.99.2,192.168.99.254,1h
dhcp-authoritative
</pre>
</div>
</div>

<div id="outline-container-org0f3ab60" class="outline-3">
<h3 id="org0f3ab60"><span class="section-number-3">3.4</span> Configure the network interfaces</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Edit /etc/network/interfaces:
</p>
<div class="org-src-container">
<pre class="src src-sh">allow-hotplug eth0
iface eth0 inet dhcp

allow-hotplug wlan0
iface wlan0 inet static
  hostapd /etc/hostapd/hostapd.conf
  address 192.168.99.1
  netmask 255.255.255.0
  network 192.168.99.0
  broadcast 192.168.99.255
</pre>
</div>

<p>
And start the interfaces:
</p>

<div class="org-src-container">
<pre class="src src-sh">ifup eth0
ifup wlan0
</pre>
</div>
</div>
</div>

<div id="outline-container-org14d4181" class="outline-3">
<h3 id="org14d4181"><span class="section-number-3">3.5</span> Give your Pi a hostname</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Edit <code>/etc/hosts</code>
</p>

<pre class="example">
192.168.99.1	raspberrypi raspberrypi.pinet
</pre>
</div>
</div>

<div id="outline-container-org555989e" class="outline-3">
<h3 id="org555989e"><span class="section-number-3">3.6</span> Restart your Pi</h3>
<div class="outline-text-3" id="text-3-6">
<div class="org-src-container">
<pre class="src src-sh">reboot
</pre>
</div>
</div>
</div>

<div id="outline-container-org51d9508" class="outline-3">
<h3 id="org51d9508"><span class="section-number-3">3.7</span> Now you should be able to connect to your Pi via WiFi</h3>
</div>
</div>

<div id="outline-container-org2957fc2" class="outline-2">
<h2 id="org2957fc2"><span class="section-number-2">4</span> Installing GeoMoose</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org71ea4de" class="outline-3">
<h3 id="org71ea4de"><span class="section-number-3">4.1</span> Again get a root shell</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Open a terminal (or connect via <code>ssh pi@192.168.99.1</code> or <code>ssh
   pi@raspberrypi.pinet</code>)
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo su
</pre>
</div>
</div>
</div>

<div id="outline-container-org90e788b" class="outline-3">
<h3 id="org90e788b"><span class="section-number-3">4.2</span> Install Apache</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-sh">apt install apache2
a2enmod cgi
systemctl stop apache2
systemctl start apache2
</pre>
</div>
</div>
</div>

<div id="outline-container-org992aa4c" class="outline-3">
<h3 id="org992aa4c"><span class="section-number-3">4.3</span> Install Mapserver (and friends)</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-sh">apt install cgi-mapserver mapserver-bin gdal-bin proj-bin
</pre>
</div>
</div>
</div>

<div id="outline-container-org590a350" class="outline-3">
<h3 id="org590a350"><span class="section-number-3">4.4</span> Install PostGIS (if you want to)</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">
<pre class="src src-sh">apt install postgis
</pre>
</div>
</div>
</div>

<div id="outline-container-org3d57fdf" class="outline-3">
<h3 id="org3d57fdf"><span class="section-number-3">4.5</span> Install GeoMoose</h3>
<div class="outline-text-3" id="text-4-5">
</div>
<div id="outline-container-org2260759" class="outline-4">
<h4 id="org2260759"><span class="section-number-4">4.5.1</span> Download and unzip GeoMoose</h4>
<div class="outline-text-4" id="text-4-5-1">
<div class="org-src-container">
<pre class="src src-sh">mkdir -p /srv/geomoose
<span style="color: #483d8b;">cd</span> /srv/geomoose
wget https://www.geomoose.org/downloads/gm3-examples-3.3.0.zip
wget https://www.geomoose.org/downloads/gm3-demo-data-3.3.0.zip

unzip gm3-examples-3.3.0.zip
unzip gm3-demo-data-3.3.0.zip
</pre>
</div>
</div>
</div>

<div id="outline-container-org2d61e0e" class="outline-4">
<h4 id="org2d61e0e"><span class="section-number-4">4.5.2</span> Configure GeoMoose for the install paths</h4>
<div class="outline-text-4" id="text-4-5-2">
<p>
Setup <code>/srv/geomoose/gm3-examples/htdocs/desktop/config.js</code>:    
</p>
<div class="org-src-container">
<pre class="src src-js">CONFIG = {
    mapserver_url: <span style="color: #8b2252;">'/cgi-bin/mapserv'</span>,
    mapfile_root: <span style="color: #8b2252;">'/srv/geomoose/gm3-demo-data/'</span>
};
</pre>
</div>

<p>
Add GeoMoose to the web-root:
</p>
<div class="org-src-container">
<pre class="src src-sh">ln -s /srv/geomoose/gm3-examples/htdocs /var/www/html/geomoose
</pre>
</div>
</div>
</div>

<div id="outline-container-org6eae24e" class="outline-4">
<h4 id="org6eae24e"><span class="section-number-4">4.5.3</span> Test GeoMoose</h4>
<div class="outline-text-4" id="text-4-5-3">
<p>
<a href="http://192.168.99.1/geomoose/desktop/">http://192.168.99.1/geomoose/desktop/</a>
</p>

<p>
or
</p>

<p>
<a href="http://raspberrypi.pinet/geomoose/desktop/">http://raspberrypi.pinet/geomoose/desktop/</a>
</p>
</div>
</div>
</div>
</div>
