Workshop.org
** Shutdown CGI Script
   When running the Raspberry Pi headless, you can usually get by just
   unplugging the power when it is time to turn it off as long as it
   wasn't busy doing something at the time.  However, it is safer to 
   tell the OS to do a proper shutdown.

   Shutdown-cgi is a simple C program that can be called from Apache
   as a CGI script and executes the "halt -p" command to shutdown the
   Pi.  After running this command, you will see the green light next
   to the USB power-in plug blink for awhile as the Pi gets ready to
   shutdown.  The green light will go out after it is done and it is
   safe to remove power.

   Note: shutdown-cgi is a C program instead of a shell (or other)
   script because it needs to be installed set-UID so it can run as
   root and have permissions to execute "halt".  Scripts don't honor
   the set-uid bit.

   To install shutdown-cgi run =sudo make install= from the
   shutdown-cgi directory.

   Then you can shutdown your Pi by going to the following URL:

   [http://192.168.99.1/cgi-bin/shutdown]

   or

   [http://raspberrypi.pinet/cgi-bin/shutdown]

   while connected to the Pi's WiFi network.

** Install a Firewall
   This workshop is intended for small, trusted WiFi networks so a
   firewall isn't strictly necessary.  However, security in layers is
   a good thing, so you may want to install a firewall on the Pi to
   limit unexpected connections.  A relatively easy one to configure
   that is included in Raspbian is =ufw=.

   It can be installed with:
   #+BEGIN_SRC sh
   sudo apt install ufw
   #+END_SRC

   An example of simple configuration:
   #+BEGIN_SRC sh
   ufw allow "DNS"
   ufw allow 67
   ufw allow "SSH"
   ufw allow "WWW Full"
   ufw enable
   #+END_SRC

   The first two lines allow DNS and DHCP queries from WiFi clients to
   the Pi.  The next two lines allow SSH and HTTP access.  Then the
   final line enables the firewall and sets it to be enabled at boot.

   Of course, the rules you need will vary depending on your needs.
   You could also tighten up access to only specific IP ranges, etc.

   If you are connected to your Pi over the network, be careful you
   don't lock yourself out.  If you do, you will need a monitor and
   keyboard to fix it (or to edit the SD card in a different Linux
   computer).
