Workshop.html

<div id="outline-container-org5675bad" class="outline-2">
<h2 id="org5675bad"><span class="section-number-2">5</span> Final Touches</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org5dced74" class="outline-3">
<h3 id="org5dced74"><span class="section-number-3">5.1</span> Shutdown CGI Script</h3>
<div class="outline-text-3" id="text-5-1">
<p>
When running the Raspberry Pi headless, you can usually get by just
unplugging the power when it is time to turn it off as long as it
wasn't busy doing something at the time.  However, it is safer to 
tell the OS to do a proper shutdown.
</p>

<p>
Shutdown-cgi is a simple C program that can be called from Apache
as a CGI script and executes the "halt -p" command to shutdown the
Pi.  After running this command, you will see the green light next
to the USB power-in plug blink for awhile as the Pi gets ready to
shutdown.  The green light will go out after it is done and it is
safe to remove power.
</p>

<p>
Note: shutdown-cgi is a C program instead of a shell (or other)
script because it needs to be installed set-UID so it can run as
root and have permissions to execute "halt".  Scripts don't honor
the set-uid bit.
</p>

<p>
To install shutdown-cgi run <code>sudo make install</code> from the
shutdown-cgi directory.
</p>

<p>
Then you can shutdown your Pi by going to the following URL:
</p>

<p>
[<a href="http://192.168.99.1/cgi-bin/shutdown">http://192.168.99.1/cgi-bin/shutdown</a>]
</p>

<p>
or
</p>

<p>
[<a href="http://raspberrypi.pinet/cgi-bin/shutdown">http://raspberrypi.pinet/cgi-bin/shutdown</a>]
</p>

<p>
while connected to the Pi's WiFi network.
</p>
</div>
</div>

<div id="outline-container-org3a3a22a" class="outline-3">
<h3 id="org3a3a22a"><span class="section-number-3">5.2</span> Install a Firewall</h3>
<div class="outline-text-3" id="text-5-2">
<p>
This workshop is intended for small, trusted WiFi networks so a
firewall isn't strictly necessary.  However, security in layers is
a good thing, so you may want to install a firewall on the Pi to
limit unexpected connections.  A relatively easy one to configure
that is included in Raspbian is <code>ufw</code>.
</p>

<p>
It can be installed with:
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo apt install ufw
</pre>
</div>

<p>
An example of simple configuration:
</p>
<div class="org-src-container">
<pre class="src src-sh">ufw allow <span style="color: #8b2252;">"DNS"</span>
ufw allow 67
ufw allow <span style="color: #8b2252;">"SSH"</span>
ufw allow <span style="color: #8b2252;">"WWW Full"</span>
ufw enable
</pre>
</div>

<p>
The first two lines allow DNS and DHCP queries from WiFi clients to
the Pi.  The next two lines allow SSH and HTTP access.  Then the
final line enables the firewall and sets it to be enabled at boot.
</p>

<p>
Of course, the rules you need will vary depending on your needs.
You could also tighten up access to only specific IP ranges, etc.
</p>

<p>
If you are connected to your Pi over the network, be careful you
don't lock yourself out.  If you do, you will need a monitor and
keyboard to fix it (or to edit the SD card in a different Linux
computer).
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2019-04-18 Thu 00:00</p>
<p class="author">Author: Jim Klassen, Bob Basques</p>
<p class="date">Created: 2019-04-18 Thu 01:28</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
